app/controllers/home_controller.rb

INSERT INTO "signups" ("userID", "password", "confirmpassword", "username", "usercountry", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["userID", ""], ["password", "d"], ["confirmpassword", ""], ["username", ""], ["usercountry", ""], ["created_at", "2018-11-07 04:28:00.292581"], ["updated_at", "2018-11-07 04:28:00.292581"]]
---
    def profile
        signup = Signup.new
        signup.userID = params[:userID]
        signup.password = params[:password]
        signup.confirmpassword = params[:confirmpassword]
        signup.username = params[:username]
        signup.userage = params[:userage]
        signup.usercountry = params[:usercountry]
        signup.save

SELECT "signups".* FROM "signups"
---
    def profile_
        @signups = Signup.all